[
    {
        "id": 1,
        "bookName": "The Catcher in the Rye",
        "authorName": "George Orwell",
        "image": "https://i.postimg.cc/c4vY4CXz/pngwing-1.png",
        "review": "A dystopian masterpiece depicting a totalitarian regime, 'The Catcher in the Rye' delves deep into themes of identity and resistance. Orwell masterfully constructs a bleak, oppressive world that feels alarmingly plausible. This novel remains a profound exploration of human nature under the strain of absolute power. Its chilling narrative will stay with you long after the last page.",
        "totalPages": 328,
        "rating": 4.7,
        "category": "Fiction",
        "tags": ["Identity", "Young Adult", "Politics"],
        "publisher": "Signet Classics",
        "yearOfPublishing": 1949
    },
    {
        "id": 2,
        "bookName": "The Great Gatsby",
        "authorName": "F. Scott Fitzgerald",
        "image": "https://i.postimg.cc/tCmTSHGG/kindpng-81724-1.png",
        "review": "A classic tale of wealth, love, and the American Dream, 'The Great Gatsby' is a poignant critique of the excesses of the Jazz Age. Fitzgerald's lyrical prose paints a vivid picture of the era's glamour and decadence. At its heart, it's a story about longing and the elusive nature of the American Dream. Gatsby's tragic pursuit of an unattainable ideal is both beautiful and heartbreaking.",
        "totalPages": 218,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Identity", "Young Adult", "1920s"],
        "publisher": "Scribner",
        "yearOfPublishing": 1925
    },
    {
        "id": 3,
        "bookName": "To Kill a Mockingbird",
        "authorName": "Harper Lee",
        "image": "https://i.postimg.cc/X7ySWMyb/kindpng-1064993.png",
        "review": "A powerful story addressing racial injustice in the American South, 'To Kill a Mockingbird' is a timeless exploration of human morality. Harper Lee's nuanced characters and compelling narrative force readers to confront uncomfortable truths about prejudice and empathy. The novel's enduring relevance is a testament to its profound impact. Scout Finch's journey is both heartwarming and thought-provoking.",
        "totalPages": 336,
        "rating": 4.4,
        "category": "Fiction",
        "tags": ["Identity", "Young Adult"],
        "publisher": "Harper Perennial Modern Classics",
        "yearOfPublishing": 1960
    },
    {
        "id": 4,
        "bookName": "The Catcher in the Rye",
        "authorName": "J.D. Salinger",
        "image": "https://i.postimg.cc/brnh34xp/kindpng-2193744-1.png",
        "review": "A coming-of-age novel capturing the disillusionment of adolescence, 'The Catcher in the Rye' is a raw and honest depiction of teenage angst. Salinger's portrayal of Holden Caulfield's struggles resonates deeply with anyone who has felt out of place. The narrative's authenticity and unfiltered emotion make it a cornerstone of American literature. It's a poignant reflection on identity and isolation.",
        "totalPages": 277,
        "rating": 4,
        "category": "Fiction",
        "tags": ["Identity", "Young Adult"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "id": 5,
        "bookName": "The Alchemist",
        "authorName": "Paulo Coelho",
        "image": "https://i.postimg.cc/ZYv4bv12/kindpng-2592315-1.png",
        "review": "A fable about following your dreams and fulfilling your destiny, 'The Alchemist' is a deeply spiritual and inspirational tale. Coelho's storytelling weaves a rich tapestry of symbolism and allegory, encouraging readers to pursue their personal legends. The novel's simplicity and profound wisdom have captivated millions. It's a journey of self-discovery that resonates with readers of all ages.",
        "totalPages": 197,
        "rating": 4.2,
        "category": "Fiction",
        "tags": ["Fable", "Inspiration", "Philosophy"],
        "publisher": "HarperOne",
        "yearOfPublishing": 1988
    },
    {
        "id": 6,
        "bookName": "Harry Potter and the Philosopher's Stone",
        "authorName": "J.K. Rowling",
        "image": "https://i.postimg.cc/5Nc16NJ0/kindpng-4022054-1.png",
        "review": "The enchanting beginning to the beloved Harry Potter series, 'Harry Potter and the Philosopher's Stone' introduces readers to a world of magic and wonder. Rowling's imaginative storytelling and richly developed characters create an unforgettable reading experience. This book is a perfect blend of adventure, friendship, and the timeless battle between good and evil. It's a must-read for all ages.",
        "totalPages": 320,
        "rating": 4.8,
        "category": "Fantasy",
        "tags": ["Wizardry", "Magic", "Children's Literature"],
        "publisher": "Bloomsbury Publishing",
        "yearOfPublishing": 1997
    },
    {
        "id": 7,
        "bookName": "The Da Vinci Code",
        "authorName": "Dan Brown",
        "image": "https://i.postimg.cc/qv4TxbzH/kindpng-4945926-1.png",
        "review": "A thrilling mystery that combines art, history, and religion, 'The Da Vinci Code' keeps readers on the edge of their seats. Dan Brown's intricate plot and fast-paced narrative make this a gripping read. The novel's exploration of historical and religious themes adds depth to its suspenseful storyline. It's a thought-provoking adventure that challenges perceptions and entertains from start to finish.",
        "totalPages": 689,
        "rating": 4.1,
        "category": "Mystery",
        "tags": ["Thriller", "Conspiracy", "Art"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2003
    },
    {
        "id": 8,
        "bookName": "Gone Girl",
        "authorName": "Gillian Flynn",
        "image": "https://i.postimg.cc/vHWy9F8v/kindpng-5624060-1.png",
        "review": "A gripping psychological thriller with unexpected twists, 'Gone Girl' delves into the dark complexities of marriage and deception. Flynn's sharp prose and intricate plotting keep readers guessing until the very end. The dual perspectives of the protagonists add a unique depth to the narrative. It's a masterful exploration of the dark side of human relationships and the masks people wear.",
        "totalPages": 432,
        "rating": 4,
        "category": "Mystery",
        "tags": ["Suspense", "Marriage", "Deception"],
        "publisher": "Broadway Books",
        "yearOfPublishing": 2012
    },
    {
        "id": 9,
        "bookName": "Harry Potter and the Prisoner of Azkaban",
        "authorName": "J.K. Rowling",
        "image": "https://i.postimg.cc/x15SxvzJ/kindpng-7318921.png",
        "review": "Harry Potter faces new challenges and discovers the truth about his past in 'Harry Potter and the Prisoner of Azkaban'. Rowling continues to expand the magical world with deeper lore and more complex characters. The introduction of the Marauders and the exploration of Harry's parents' history add emotional depth. This book is a thrilling adventure filled with mystery and heartwarming moments.",
        "totalPages": 435,
        "rating": 4.7,
        "category": "Fantasy",
        "tags": ["Wizardry", "Magic", "Children's Literature"],
        "publisher": "Scholastic",
        "yearOfPublishing": 1999
    }
]
